Revit 2027 API
ParameterTypeId.BoundaryRestraintY Property
 "Y Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryRestraintY { get; }
Public Shared ReadOnly Property BoundaryRestraintY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryRestraintY {
	ForgeTypeId^ get ();
}
static member BoundaryRestraintY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace